#include <stdio.h>

int main()
{
int num1,num2,num3;
printf("Δώστε τρείς ακέραιους αριθμούς: ");
scanf("%d%d%d", &num1,&num2,&num3); //διαβάζει και τους 3 αριθμούς σε μία γραμμή

//Εάν το num1 είναι  μεγαλύτερο από το num2, τότε το num1 είναι ο μεγαλύτερος αριθμός 
if (num1>=num2 && num1>=num3)
printf("%d είναι ο μεγαλύτερος αριθμός", num1);

//Εάν το num2 είναι  μεγαλύτερο από το num1, τότε το num2 είναι ο μεγαλύτερος αριθμός 
if (num2>=num1 && num2>=num3)
printf("%d είναι ο μεγαλύτερος αριθμός", num2);

//Εάν το num3 είναι  μεγαλύτερο από το num1 και το num2, τότε το num3 είναι ο μεγαλύτερος αριθμός
if (num3>=num1 && num3>=num2)
printf("%d είναι ο μεγαλύτερος αριθμός", num3);

    return 0;
}
