#include <stdio.h>

int main()
{
int int_1,int_2, temp;

printf("Δώστε τον πρώτο ακέραιο αριθμό: ");
scanf("%d", &int_1);
printf("Δώστε τον δεύτερο ακέραιο αριθμό: ");
scanf("%d", &int_2);

//η τιμή του int_1 πηγαίνει στην μεταβλητή temp
temp=int_1;

//η τιμή του int_2 πηγαίνει στην μεταβλητή int_1
int_1=int_2;

//η τιμή του temp (αρχική τιμή του int_1) πηγαίνει στην μεταβλητή int_2
int_2=temp;

printf("\nΜετά την αντιμετάθεση, πρώτος αριθμός = %d\n", int_1);
printf("Μετά την αντιμετάθεση, δεύτερος αριθμός = %d", int_2);

    return 0;
}